app/views/gossips/index.html.erb


                <p class="card-text text-muted "><%= gossip.user.first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]