app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

    <p>Auteur : <a href="<%= user_path(@user.id)%>"><%= @gossip.user.last_name%> <%= @gossip.user.first_name%></a>