app/controllers/cities_controller.rb

  def show

    @city = City.find(params[:id])
    @city_gossips = []
    Gossip.all.each do |gossip|
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"