app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "bonjour ending up liking each other, and knocking out a twelve-foot mountain troll is one of them."], ["updated_at", "2020-02-13 15:49:50.354821"], ["id", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])

    @gossip.update(gossip_params)

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "nathan"], ["content", "puducu"], ["user_id", 5], ["created_at", "2020-02-13 16:49:01.454100"], ["updated_at", "2020-02-13 16:49:01.454100"]]
---
  def create
     @gossip = Gossip.new(user: User.last, title: params[:title],content: params[:content])

     if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 20]]
---
  def destroy
    @gossip = Gossip.find(params[:id])

    if @gossip.destroy