app/controllers/sessions_controller.rb

  def new
    @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hadrien@mail.com"], ["LIMIT", 1]]