app/views/cities/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
                <h5 class="card-title"><%=gossip.title%></h5>
                <h6 class="card-subtitle mb-2 text-muted">By <%=gossip.user.first_name%></h6>