app/views/layouts/application.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
       <li class="nav-item">
          <%= link_to "#{User.find_by(id: session[:user_id]).email}", user_path(session.id)%>